cf/InformationRegisters/бпсОшибки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9.1">
	<InformationRegister>
		<Properties>
			<Name>бпсОшибки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОшибки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бпсТипыОшибок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/бпсОшибки/Ext/ManagerModule.bsl
Процедура ДобавитьОшибку(Ошибка,ТипОшибки) Экспорт
	МенеджерЗаписи = РегистрыСведений.бпсОшибки.СоздатьМенеджерЗаписи();
	
	ИдентификаторОшибки = Строка(Новый УникальныйИдентификатор());
	МенеджерЗаписи.ИдентификаторОшибки = ИдентификаторОшибки;
	МенеджерЗаписи.ДатаОшибки = ТекущаяДата();
	//МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.CurrentUser;
	МенеджерЗаписи.ТипОшибки = ТипОшибки;
	МенеджерЗаписи.Ошибка = Ошибка;
	
	МенеджерЗаписи.Записать();
	Сообщить(Ошибка);
КонецПроцедуры
